
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьДеревоРегистров();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоРегистров()
	КорневыеСтроки = ТаблицаРегистров.ПолучитьЭлементы();
	КорневыеСтроки.Очистить();
	
	СтрокаНакопления = КорневыеСтроки.Добавить();
	СтрокаНакопления.СинонимРегистра = НСтр("ru = 'Регистры накопления'");
	
	ЗаполнитьПодчиненныеРегистры(СтрокаНакопления.ПолучитьЭлементы(), Метаданные.РегистрыНакопления);
	
	СтрокаСведений = КорневыеСтроки.Добавить();
	СтрокаСведений.СинонимРегистра = НСтр("ru = 'Регистры сведений'");
	
	ЗаполнитьПодчиненныеРегистры(СтрокаСведений.ПолучитьЭлементы(), Метаданные.РегистрыСведений);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодчиненныеРегистры(КоллекцияСтрокФормы, КоллекцияМетаданных)
	
	ВременнаяТаблица = Новый ТаблицаЗначений;
	ВременнаяТаблица.Колонки.Добавить("Использовать",    Новый ОписаниеТипов("Булево"));
	ВременнаяТаблица.Колонки.Добавить("ИмяРегистра",     Новый ОписаниеТипов("Строка"));
	ВременнаяТаблица.Колонки.Добавить("СинонимРегистра", Новый ОписаниеТипов("Строка"));
	
	Для Каждого МетаРегистр Из КоллекцияМетаданных Цикл
		
		Если Не ПравоДоступа("Чтение", МетаРегистр) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = КоллекцияСтрокФормы.Добавить();
		НоваяСтрока.Использовать = Ложь;
		НоваяСтрока.ИмяРегистра = МетаРегистр.Имя;
		
		СинонимОбъекта = МетаРегистр.Синоним;
		НоваяСтрока.СинонимРегистра = ?(ЗначениеЗаполнено(СинонимОбъекта), СинонимОбъекта, МетаРегистр.Имя);
		
	КонецЦикла;
	
	ВременнаяТаблица.Сортировать("СинонимРегистра Возр");
	
	Для Каждого СтрокаИзТЗ Из ВременнаяТаблица Цикл
		
		НоваяСтрокаФормы = КоллекцияСтрокФормы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаФормы, СтрокаИзТЗ);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьСтруктуру(Команда)
	
	ВыбранныеРегистры = Новый Массив;
	
	ПолучитьВыбранныеРегистрыДерева(ТаблицаРегистров.ПолучитьЭлементы(), ВыбранныеРегистры);
	
	Если ВыбранныеРегистры.Количество() = 0 Тогда
		ПоказатьПредупреждение(, NStr("ru = 'Не выбрано ни одного регистра для синхронизации!'"));
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьРегистрыВОчередиНаСервере(ВыбранныеРегистры);
	
	ПоказатьОповещениеПользователя(NStr("ru = 'Успех'"),, NStr("ru = 'Регистры успешно добавлены в очередь обработки!'"));

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВыбранныеРегистрыДерева(КоллекцияЭлементов, ВыбранныеРегистры)
	
	Для Каждого ЭлементДерева Из КоллекцияЭлементов Цикл
		
		Если ЗначениеЗаполнено(ЭлементДерева.ИмяРегистра) И ЭлементДерева.Использовать Тогда
			
			Родитель = ЭлементДерева.ПолучитьРодителя();
			ТипРегистра = ?(Родитель <> Неопределено И СтрНайти(Родитель.СинонимРегистра, "накопления") > 0, "РегистрНакопления.", "РегистрСведений.");
			
			ВыбранныеРегистры.Добавить(ТипРегистра + ЭлементДерева.ИмяРегистра);
			
		КонецЕсли;
		
		ПолучитьВыбранныеРегистрыДерева(ЭлементДерева.ПолучитьЭлементы(), ВыбранныеРегистры);
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ОтладитьГенератор(Команда)
	
	ОтладитьГенераторНаСервере(); 
	
	ПоказатьОповещениеПользователя(
		НСтр("ru = 'Генератор отработал'"),, 
		НСтр("ru = 'Проверьте изменения в регистре очереди!'")
	);
	
КонецПроцедуры

&НаСервере
Процедура ОтладитьГенераторНаСервере()
	
	уни_ИнтеграцияСУБДСервер.СформироватьПакетыМакетовДляВыгрузки();
	
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьРегистрыВОчередиНаСервере(МассивИменРегистров)
	
	Для Каждого ПолноеИмяРегистра Из МассивИменРегистров Цикл
		
		уни_ИнтеграцияСУБДСервер.ЗарегистрироватьТаблицуВОчереди(ПолноеИмяРегистра);
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтладитьТранспорт(Команда)
	
	ОтладитьТранспортНаСервере();
	
	ПоказатьОповещениеПользователя(
		НСтр("ru = 'Транспорт отработал'"),, 
		НСтр("ru = 'Проверьте состояние регистра и базу PostgreSQL!'")
	);
	
КонецПроцедуры

&НаСервере
Процедура ОтладитьТранспортНаСервере()
	
	уни_ИнтеграцияСУБДСервер.ОтправитьГотовыеПакетыНаШлюз();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтладитьГенераторДанных(Команда)
	
	ОтладитьГенераторДанныхНаСервере();
	
	ПоказатьОповещениеПользователя(
		НСтр("ru = 'Генератор данных отработал'"),, 
		НСтр("ru = 'Проверьте новый регистр очереди данных!'")
	);
	
КонецПроцедуры

&НаСервере
Процедура ОтладитьГенераторДанныхНаСервере()
	
	уни_ИнтеграцияСУБДСервер.СформироватьПакетыДанныхИзРегистров();
	
КонецПроцедуры